Welcome to the SQL mini project. You will carry out this project partly in the PhpMyAdmin interface and partly in Jupyter via a Python connection.

This is Tier 2 of the case study, which means that there'll be less guidance for you about how to set up
your local SQLite connection in PART 2 of the case study. This will make the case study more challenging for you:  you might need to do some digging and revise the Working with Relational Databases in Python chapter in the previous resource.

Otherwise, the questions in the case study are the same as with Tier 1. 

PART 1: PHPMyAdmin

You will complete questions 1-9 below in the PHPMyAdmin interface.  Log in by pasting the following URL into your browser, and using the following Username and Password:

URL: https://sql.springboard.com/
Username: student
Password: learn_sql@springboard

The data you need is in the "country_club" database. This database
contains 3 tables:
    i) the "Bookings" table,
    ii) the "Facilities" table, and
    iii) the "Members" table.

In this case study, you'll be asked a series of questions. You can solve them using the platform, but for the final deliverable, paste the code for each solution into this script and upload it to your GitHub.

Before starting the questions, feel free to take your time to explore the data and get acquainted with the 3 tables. */
 



query_11 = """
SELECT
    			m1.surname AS member_surname,
    			m1.firstname AS member_firstname,
    			m2.surname AS recommender_surname,
    			m2.firstname AS recommender_firstname
FROM Members AS m1
INNER JOIN Members AS m2 on m1.recommendedby = m2.memid
ORDER BY m1.surname,m1.firstname;
"""

q11_result = pd.read_sql_query(query_11,conn)
q11_result


query_12 = """
SELECT f.name, CONCAT(m.firstname, ' ', m.surname) AS member_name,
			CASE WHEN b.memid!=0 THEN 'Used BY Member'
    			ELSE 'Used by Guest' END AS usages
FROM Facilities AS f
INNER JOIN Bookings AS b ON f.facid = b.facid
INNER JOIN Members AS m ON b.memid = m.memid
WHERE b.memid != 0
ORDER BY f.name, member_name;
"""

q12_result = pd.read_sql_query(query_12, conn)
q12_result


query_13 = """
SELECT f.name AS facility_name, CONCAT(m.firstname, ' ',m.surname) AS member_name, strftime('%m', b.starttime) AS month,
			CASE WHEN b.memid = 0 THEN 'Guest_Usage'
    			ELSE 'Member_Usage'
 			END AS facility_usage
FROM Bookings AS b
INNER JOIN Facilities AS f ON b.facid = f.facid
INNER JOIN Members AS m ON b.memid = m.memid
WHERE b.memid != 0 
ORDER BY facility_name;
"""

q13_result = pd.read_sql_query(query_13,conn)
q13_result

/* QUESTIONS */

/* Q1: Some of the facilities charge a fee to members, but some do not. Write a SQL query to produce a list of the names of the facilities that do.*/

SELECT name
FROM Facilities
WHERE membercost > 0;

/* Q2: How many facilities do not charge a fee to members? 
*/

SELECT name
FROM Facilities
WHERE membercost = 0;

/* Q3: Write an SQL query to show a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost. Return the facid, facility name, member cost, and monthly maintenance of the facilities in question. 
*/

SELECT facid, name, membercost, monthlymaintenance
FROM Facilities
WHERE membercost > 0
		AND membercost < (monthlymaintenance * 0.20);

/* Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5. Try writing the query without using the OR operator. 
*/

SELECT *
FROM Facilities
WHERE facid IN (1,5);

/* Q5: Produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100. Return the name and monthly maintenance of the facilities in question. 
*/

SELECT name, monthlymaintenance, 
		CASE WHEN monthlymaintenance > 100 THEN 'EXPENSIVE'
    		ELSE 'CHEAP' END AS labelled
FROM Facilities;

/* Q6: You'd like to get the first and last name of the last member(s) who signed up. Try not to use the LIMIT clause for your solution. 
*/

SELECT firstname, surname AS lastname
FROM Members
WHERE joindate = (SELECT MAX(joindate)
FROM Members);

/* Q7: Produce a list of all members who have used a tennis court. Include in your output the name of the court, and the name of the member formed as a single column. Ensure no duplicate data and order by the member’s name. 
*/

WITH Members_Booking AS (
    		SELECT f.name AS court, m.firstname, m.surname
    		FROM Bookings AS b
    		INNER JOIN Facilities AS f ON b.facid = f.facid
    		INNER JOIN Members AS m on b.memid = m.memid
    		WHERE f.name LIKE 'Tennis Court%'
)
SELECT DISTINCT CONCAT (court, ' - ', firstname, ' ', surname) AS court_members
FROM Members_Booking
ORDER BY court_members;

/* Q8: Produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30. Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries. 
*/

SELECT f.name AS facility,
		CONCAT(m.firstname, ' ', m.surname) AS member_name,
    		CASE WHEN m.memid = 0 THEN b.slots * f.guestcost
    		ELSE b.slots * f.membercost
    		END AS total_cost
FROM Bookings AS b
INNER JOIN Facilities AS f ON b.facid = f.facid
INNER JOIN Members m ON b.memid = m.memid
WHERE b.starttime LIKE '2012-09-14%'
AND (CASE WHEN m.memid = 0 THEN b.slots * f.guestcost
     			ELSE b.slots * f.membercost END) > 30
ORDER BY total_cost DESC;

/* Q9: This time, produce the same result as in Q8, but using a subquery. 
*/

SELECT * FROM (
    		SELECT f.name AS facility,
    		CONCAT(m.firstname, ' ', m.surname) AS member_name,
           		CASE WHEN b.memid = 0 THEN b.slots * f.guestcost
           			ELSE b.slots * f.membercost
           		END AS total_cost
		FROM Bookings AS b
		INNER JOIN Facilities AS f ON b.facid = f.facid
		INNER JOIN Members AS m ON b.memid = m.memid
		WHERE b.starttime LIKE '2012-09-14%'
) AS Sub_query
WHERE total_cost > 30
ORDER BY total_cost;

/* PART 2: SQLite */

/* Export the country club data from PHPMyAdmin and connect to a local SQLite instance from a Jupyter notebook for the following questions  */

In [1]:
import sqlite3
import pandas as pd

# 1. Connect to the database file
conn = sqlite3.connect('sqlite_db_pythonsqlite.db')

# 2. SQL to find all table names
# 'sqlite_master' is a special system table that lists everything in the DB
my_query = """
SELECT name 
FROM sqlite_master 
WHERE type='table';
"""

# 3. Use pandas to run the query
df_tables = pd.read_sql_query(my_query, conn)

# 4. Display the results
print("Tables in this database:")
print(df_tables)

Tables in this database:
         name
0    Bookings
1  Facilities
2     Members

/* QUESTIONS */

/* Q10: Produce a list of facilities with a total revenue of less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members! 
*/

In [10]:
query_q10 = """
SELECT name, sum(revenue) AS total_revenue
From (SELECT f.name,
    CASE WHEN b.memid = 0 THEN b.slots * f.guestcost
    ELSE b.slots * f.membercost
    END AS revenue
    FROM Facilities AS f
    INNER JOIN Bookings AS b ON f.facid = b.facid
) AS subquery
GROUP BY name
HAVING total_revenue < 1000
ORDER BY total_revenue;
"""
q10_results = pd.read_sql_query(query_q10, conn)
q10_results

            name  total_revenue
0   Table Tennis            180
1  Snooker Table            240
2     Pool Table            270

/* Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order 
*/

In [11]:
query_11 = """
SELECT
    m1.surname AS member_surname,
    m1.firstname AS member_firstname,
    m2.surname AS recommender_surname,
    m2.firstname AS recommender_firstname
FROM Members AS m1
INNER JOIN Members AS m2 on m1.recommendedby = m2.memid
ORDER BY m1.surname,m1.firstname;
"""
q11_result = pd.read_sql_query(query_11,conn)
q11_result

,member_surname,member_firstname,recommender_surname,recommender_firstname
0,Bader,Florence,Stibbons,Ponder
1,Baker,Anne,Stibbons,Ponder
2,Baker,Timothy,Farrell,Jemima
3,Boothe,Tim,Rownam,Tim
4,Butters,Gerald,Smith,Darren
5,Coplin,Joan,Baker,Timothy
6,Crumpet,Erica,Smith,Tracy
7,Dare,Nancy,Joplette,Janice
8,Genting,Matthew,Butters,Gerald
9,Hunt,John,Purview,Millicent
10,Jones,David,Joplette,Janice
11,Jones,Douglas,Jones,David
12,Joplette,Janice,Smith,Darren
13,Mackenzie,Anna,Smith,Darren
14,Owen,Charles,Smith,Darren
15,Pinker,David,Farrell,Jemima
16,Purview,Millicent,Smith,Tracy
17,Rumney,Henrietta,Genting,Matthew
18,Sarwin,Ramnaresh,Bader,Florence
19,Smith,Jack,Smith,Darren
20,Stibbons,Ponder,Tracy,Burton
21,Worthington-Smyth,Henry,Smith,Tracy

/* Q12: Find the facilities with their usage by member, but not guests 
*/

In [12]:
query_12 = """
SELECT f.name, CONCAT(m.firstname, ' ', m.surname) AS member_name,
	CASE WHEN b.memid=0 THEN 'Guest_Usage'
    ELSE 'Member_Usage' END AS usages
FROM Facilities AS f
INNER JOIN Bookings AS b ON f.facid = b.facid
INNER JOIN Members AS m ON b.memid = m.memid
WHERE b.memid != 0
ORDER BY f.name, member_name;
"""
q12_result = pd.read_sql_query(query_12, conn)
q12_result

                 name     member_name        usages
0     Badminton Court  Anna Mackenzie  Member_Usage
1     Badminton Court  Anna Mackenzie  Member_Usage
2     Badminton Court  Anna Mackenzie  Member_Usage
3     Badminton Court  Anna Mackenzie  Member_Usage
4     Badminton Court  Anna Mackenzie  Member_Usage
...               ...             ...           ...
3155   Tennis Court 2   Timothy Baker  Member_Usage
3156   Tennis Court 2   Timothy Baker  Member_Usage
3157   Tennis Court 2   Timothy Baker  Member_Usage
3158   Tennis Court 2     Tracy Smith  Member_Usage
3159   Tennis Court 2     Tracy Smith  Member_Usage

[3160 rows x 3 columns]

/* Q13: Find the facilities usage by month, but not guests 
*/

In [13]:
query_13 = """
SELECT f.name AS facility_name, CONCAT(m.firstname, ' ',m.surname) AS member_name, strftime('%m', b.starttime) AS month,
	CASE WHEN b.memid = 0 THEN 'Guest_Usage'
    ELSE 'Member_Usage'
    END AS facility_usage
FROM Bookings AS b
INNER JOIN Facilities AS f ON b.facid = f.facid
INNER JOIN Members AS m ON b.memid = m.memid
WHERE b.memid != 0 
ORDER BY facility_name;
"""

q13_result = pd.read_sql_query(query_13,conn)
q13_result

        facility_name   member_name month facility_usage
0     Badminton Court  Darren Smith    07   Member_Usage
1     Badminton Court  Darren Smith    07   Member_Usage
2     Badminton Court  Darren Smith    07   Member_Usage
3     Badminton Court  Darren Smith    07   Member_Usage
4     Badminton Court  Darren Smith    07   Member_Usage
...               ...           ...   ...            ...
3155   Tennis Court 2    Tim Boothe    09   Member_Usage
3156   Tennis Court 2  Charles Owen    09   Member_Usage
3157   Tennis Court 2   David Jones    09   Member_Usage
3158   Tennis Court 2  Charles Owen    09   Member_Usage
3159   Tennis Court 2    Tim Boothe    09   Member_Usage

[3160 rows x 4 columns]